<template>
  <div class="content-container">
    <div class="solarsystem">
      <p>Со́лнечная систе́ма — планетная система, включающая в себя центральную звезду — Солнце — и все естественные космические объекты, вращающиеся вокруг Солнца. Она сформировалась путём гравитационного сжатия газопылевого облака примерно 4,57 млрд лет назад.

Бо́льшая часть массы объектов Солнечной системы приходится на Солнце; остальная часть содержится в восьми относительно уединённых планетах, имеющих почти круговые орбиты и располагающихся в пределах почти плоского диска — плоскости эклиптики. Общая масса системы составляет около 1,0014 M☉. При таком распределении масс особенностью кинематики системы является противоречащее ожидаемому распределение моментов импульсов вращения между Солнцем и планетами, т.н. «Проблема моментов»: на долю Солнца, масса которого в ~740 раз больше общей массы планет, приходится всего 2% общего момента системы, а остальные 98% на ~0,001 общей массы Солнечной системы.</p>
      <div class="sun" id="sun"><b>Солнце</b> — звезда Солнечной системы и её главный компонент. Его масса (332 900 масс Земли) достаточно велика для поддержания термоядерной реакции в его недрах, при которой высвобождается большое количество энергии, излучаемой в пространство в основном в виде электромагнитного излучения, максимум которого приходится на диапазон длин волн 400—700 нм, соответствующий видимому свету.

По звёздной классификации Солнце — типичный жёлтый карлик класса G2. Это название может ввести в заблуждение, так как по сравнению с большинством звёзд в нашей Галактике Солнце — довольно большая и яркая звезда. Класс звезды определяется её положением на диаграмме Герцшпрунга — Рассела, которая показывает зависимость между яркостью звёзд и температурой их поверхности. Обычно более горячие звёзды являются более яркими. Бо́льшая часть звёзд находится на так называемой главной последовательности этой диаграммы, Солнце расположено примерно в середине этой последовательности. Более яркие и горячие, чем Солнце, звёзды сравнительно редки, а более тусклые и холодные звёзды (красные карлики) встречаются часто, составляя 85 % звёзд в Галактике.</div>
      <div class="mercury" id="mercury"> <b>Меркурий</b> (0,4 а. е. от Солнца) является ближайшей планетой к Солнцу и наименьшей планетой системы (0,055 массы Земли). У планеты нет спутников. Характерными деталями рельефа его поверхности, помимо ударных кратеров, являются многочисленные лопастевидные уступы, простирающиеся на сотни километров.</div>
      <div class="venus"></div>
      <div class="earth"></div>
      <div class="mars"></div>
      <div class="jupiter" id="jupiter"><b>Юпи</b> — звезда Солнечной системы и её главный компонент. Его масса (332 900 масс Земли) достаточно велика для поддержания термоядерной реакции в его недрах, при которой высвобождается большое количество энергии, излучаемой в пространство в основном в виде электромагнитного излучения, максимум которого приходится на диапазон длин волн 400—700 нм, соответствующий видимому свету.

По звёздной классификации Солнце — типичный жёлтый карлик класса G2. Это название может ввести в заблуждение, так как по сравнению с большинством звёзд в нашей Галактике Солнце — довольно большая и яркая звезда. Класс звезды определяется её положением на диаграмме Герцшпрунга — Рассела, которая показывает зависимость между яркостью звёзд и температурой их поверхности. Обычно более горячие звёзды являются более яркими. Бо́льшая часть звёзд находится на так называемой главной последовательности этой диаграммы, Солнце расположено примерно в середине этой последовательности. Более яркие и горячие, чем Солнце, звёзды сравнительно редки, а более тусклые и холодные звёзды (красные карлики) встречаются часто, составляя 85 % звёзд в Галактике.</div>
      <div class="saturn"></div>
      <div class="uranus"></div>
      <div class="neptune"></div>
      <div class="pluto"></div>
    </div>
  </div>
</template>

<script>
import AppNav from './../components/AppNav.vue';
export default {
  components: {
    AppNav
  }
}
</script>

<style>
  .solarsystem div {
    margin-bottom: 130px;
  }
</style>
